# Сюда будеи пихать наши сервисные функции


# -----------------------------------------------------------------------------------------------------------------
# ---------------------------------------- Получение информации об ОС ---------------------------------------------
def get_platform():
    """
    Получение информации о системе - Это важно

    :return:
    """

    import platform

    # получаем нашу систему -
    platform_os = platform.system()

    if 'Windows' in platform_os:
        platform_os = 'Windows'
    else:
        platform_os = 'Linux'

    return platform_os
# ------------------------------------------------------------------------------------------------------------------
